pub fn frame(text: &str, padding: u32, style: u8, corners: u8) -> String
{

    let mut final_text = String::new();

    let mut max_width:u32 = 0;
    for line in text.lines()
    {

        let line_width = line.chars().count() as u32;

        if line_width > max_width
        {

            max_width = line_width;

        }

    }

    let total_width = max_width + (padding as u32 * 2);

    match corners
    {

        1 => match style
        {

            0 => final_text.push_str(&format!("▆{}▆\n", "═".repeat(total_width as usize))),
            _ => final_text.push_str(&format!("▆{}▆\n", "─".repeat(total_width as usize))),

        },
        2 => match style
        {

            0 => final_text.push_str(&format!("😎{}😎\n", "═".repeat(total_width as usize))),
            _ => final_text.push_str(&format!("😎{}😎\n", "─".repeat(total_width as usize))),

        },
        _ => match style
        {

            1 => final_text.push_str(&format!("┌{}┐\n", "─".repeat(total_width as usize))),
            2 => final_text.push_str(&format!("╭{}╮\n", "─".repeat(total_width as usize))),
            _ => final_text.push_str(&format!("╔{}╗\n", "═".repeat(total_width as usize))),

        },

    }

    for _i in 0..padding
    {

        match style
        {

            0 => final_text.push_str(&format!("║{}║\n", " ".repeat(total_width as usize))),
            _ => final_text.push_str(&format!("│{}│\n", " ".repeat(total_width as usize))),

        }

    }


    for line in text.lines()
    {
        match style
        {

            0 => final_text.push_str(&format!("║{}{}{}║\n", " ".repeat(padding as usize), line, " ".repeat((total_width - padding - line.chars().count() as u32) as usize))),
            _ => final_text.push_str(&format!("│{}{}{}│\n", " ".repeat(padding as usize), line, " ".repeat((total_width - padding - line.chars().count() as u32) as usize))),
            
        }

    }


    for _i in 0..padding
    {

        match style
        {

            0 => final_text.push_str(&format!("║{}║\n", " ".repeat(total_width as usize))),
            _ => final_text.push_str(&format!("│{}│\n", " ".repeat(total_width as usize))),

        }

    }

    match corners
    {

        1 => match style
        {

            0 => final_text.push_str(&format!("▆{}▆\n", "═".repeat(total_width as usize))),
            _ => final_text.push_str(&format!("▆{}▆\n", "─".repeat(total_width as usize))),

        },
        2 => match style
        {

            0 => final_text.push_str(&format!("😎{}😎\n", "═".repeat(total_width as usize))),
            _ => final_text.push_str(&format!("😎{}😎\n", "─".repeat(total_width as usize))),

        },
        _ => match style
        {

            1 => final_text.push_str(&format!("└{}┘\n", "─".repeat(total_width as usize))),
            2 => final_text.push_str(&format!("╰{}╯\n", "─".repeat(total_width as usize))),
            _ => final_text.push_str(&format!("╚{}╝\n", "═".repeat(total_width as usize))),

        },

    }


    return final_text;

}




#[allow(dead_code)]
pub fn logo () -> String
{

    return "



                                                                                    
                                                                                    
                                                                                    
                                                                                    
                                                                                    
                                  ██████      ████████████  ███                     
                                     █ █████    █     █ █       █                   
                              ██████  █     ████    ██ ███     ███  ██              
                                     █  █ ████  ██████   ███ ██████ ████      ███   
                              ████ ███ ██████ █    █ █ ████████   ████████   ████   
                                ████ █ ███████ ██   ██████  █ ████ █████████████    
                           ███    █████████████  █████ █ ████ ████ █████████████    
                         ███  ███    █████████ ██ ████ ████     █████████     █     
                       ███    ██████████████████ ███ █         ██             █     
                    ████       ██ █████████████████ ██         █ █████ ██           
                 ████          █████████████████████ █         █   █   █            
               ███     ████     ██ █████████████████ █    █████ ███  ██             
             ███     ████████   ██ ███████████████ ███ █ ███████  ███    █          
          ████       ██████████  ██████████████████████ █ ████████  ████  ██        
         ██     █    ████████████████████████████████████     ██████  ████          
       ███    █████   █████████████████████████ ███████████      ██   █████  █      
     ███     ████████ ████████████████  ███████  █████████████   ██ █ ███           
             █████████ █████████████  ███ ████   ███████████ ██   █ █     ████      
     ███     ██████████ █████████  ██████   █ ███████████ █████████ ████████        
       ███    ████████████████  █████████ ██ ██████  ████ ███████  █████████        
        ████  ██████████████ ███████████████  ███ █████  █ ███████ ████████         
          ███████████████  ███████████ ██ ███  ██████████ █   █ ██ ██████  █        
        █  ███████████  ██████████████████████ ███████████ █ █ █ █ █     ███        
            ████████ ██████████████ ██████ █ ██    █████  ████████ ██████           
              ██████ ██ █████████████ ████████████ ████  █ █                        
                █████  █████████ ███████████████████   ██  █                        
                 █████ █ ██████ █████████████ ███████ ██ ██                         
                   ███████ ██████████████████████ ██ ██ ██                          
                     ██ █ ██ █ █████████████ ███ ██ ███ █                           
                       ███ ████ ██████████████ ███ ███ ██                           
                         ██████  ████████████ ██  ███ ██                            
                           ██ ██████████████ ██  ███  █                             
                             █  ██ ███████████ █████ ██                             
                               ██████████████ █████                                 
                                  ████████████████                                  
                                     ███████████                                    

    ".to_string()

}